wintersmith/contents/articles/Java/2014-10-13-LinkedHashMap.html
---
date: 2014-10-13 15:18:00
template: tech.jade
title: LinkedHashMap 特性和用途
category: Java
chage_frequency: monthly
tag: java
---

<p>
无意中在Netty代码中看到一个函数，testOrderMap，里面提到LinkedHashMap有序性，这个真心不知道，所以转头去看LinkedHashMap的代码，看到一些不错的点记录下来。
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">内部实现</a></li>
<li><a href="#sec-2">LinkedHashMap 的特点</a></li>
<li><a href="#sec-3">Reference</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-4">
<h4 id="sec-1">内部实现</h4>
<div class="outline-text-4" id="text-1">

<p>LinkedHashMap内部实现是在原有HashMap之上添加了一个Double Linked List。
在遍历上要比HashMap快速。
</p></div>

</div>

<div id="outline-container-2" class="outline-4">
<h4 id="sec-2">LinkedHashMap 的特点</h4>
<div class="outline-text-4" id="text-2">

<ul>
<li>有序性
  能够保证某种有序性，非排序有序性，而是指某种稳定性：
<dl>
<dt>access-ordered</dt><dd>按照访问时间排序，最近访问的排在最前面。这一点可以被用作cache。
</dd>
<dt>insert-ordered</dt><dd>按照插入顺序排序，最后插入的排在最前面。更新不影响次序。
</dd>
</dl>

<p>  上面2点有序性是互斥的，即2者必居其一。
  你可以通过下面的构造函数指定这种有序性，默认是插入有序:
</p>


<pre class="example">public LinkedHashMap(int initialCapacity,
                       float loadFactor,
                       boolean accessOrder) {
      super(initialCapacity, loadFactor);
      this.accessOrder = accessOrder;
  }
</pre>


<p>
  关于access-ordered特性的实现，通过覆盖HashMap.Entry.recordAccess方法。
  HashMap.Entry.还有一个recordRemoval方法，在Entry被remove的时候调用。（之前不知道)
</p></li>
<li>非线程安全
  LinkedHashMap并没有做并发保护，要使用在Concurrent环境，请加壳保护：



<pre class="example">Map m = Collections.synchronizedMap(new LinkedHashMap(...));
</pre>

</li>
<li>ConcurrentModifyException
  同其他Collection对象类似，在获取Iterator对象后，Iterator对象会比对Map的ModCount，如果发现ModCount不一致，就抛出此异常，fast-fail。
</li>
<li>removeEldestEntry
  支持添加映射的时候触发剔除陈旧的映射，可以用此来实现有界的map（如Hibernate的BoundedConcurrentHashMap就是基于此特性实现）。

<p>  
  默认的实现是返回false，即不做evcit。
</p></li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-4">
<h4 id="sec-3">Reference</h4>
<div class="outline-text-4" id="text-3">

<ul>
<li>Jdk java.util.LinkedHashMap 类
</li>
</ul>

</div>
</div>
